; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-23)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl6)
	(at plane2 city3)
	(fuel-level plane2 fl5)
	(at plane3 city2)
	(fuel-level plane3 fl1)
	(at plane4 city4)
	(fuel-level plane4 fl6)
	(at plane5 city4)
	(fuel-level plane5 fl3)
	(at plane6 city5)
	(fuel-level plane6 fl5)
	(at person1 city0)
	(at person2 city2)
	(at person3 city1)
	(at person4 city0)
	(at person5 city0)
	(at person6 city0)
	(at person7 city2)
	(at person8 city2)
	(at person9 city1)
	(at person10 city2)
	(at person11 city5)
	(at person12 city5)
	(at person13 city2)
	(at person14 city2)
	(at person15 city3)
	(at person16 city4)
	(at person17 city3)
	(at person18 city0)
	(at person19 city5)
	(at person20 city2)
	(at person21 city3)
	(at person22 city4)
	(at person23 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane5 city5)
	(at person1 city0)
	(at person2 city3)
	(at person3 city4)
	(at person4 city3)
	(at person5 city3)
	(at person6 city2)
	(at person7 city1)
	(at person8 city4)
	(at person9 city3)
	(at person10 city3)
	(at person11 city3)
	(at person12 city5)
	(at person13 city1)
	(at person15 city1)
	(at person16 city1)
	(at person17 city4)
	(at person18 city0)
	(at person19 city2)
	(at person20 city4)
	(at person21 city4)
	(at person22 city3)
	(at person23 city0)
	))

)

; plan
1. (fly plane6 city5 city0 fl5 fl4)
   deleted: (at plane6 city5) (fuel-level plane6 fl5)
   added: (at plane6 city0) (fuel-level plane6 fl4)
   goals met: 3 of 23
2. (board person6 plane6 city0)
   deleted: (at person6 city0)
   added: (in person6 plane6)
   goals met: 3 of 23
3. (board person5 plane6 city0)
   deleted: (at person5 city0)
   added: (in person5 plane6)
   goals met: 3 of 23
4. (board person4 plane6 city0)
   deleted: (at person4 city0)
   added: (in person4 plane6)
   goals met: 3 of 23
5. (zoom plane6 city0 city2 fl4 fl3 fl2)
   deleted: (at plane6 city0) (fuel-level plane6 fl4)
   added: (at plane6 city2) (fuel-level plane6 fl2)
   goals met: 3 of 23
6. (debark person6 plane6 city2)
   deleted: (in person6 plane6)
   added: (at person6 city2)
   goals met: 4 of 23
7. (zoom plane6 city2 city3 fl2 fl1 fl0)
   deleted: (at plane6 city2) (fuel-level plane6 fl2)
   added: (at plane6 city3) (fuel-level plane6 fl0)
   goals met: 4 of 23
8. (debark person5 plane6 city3)
   deleted: (in person5 plane6)
   added: (at person5 city3)
   goals met: 5 of 23
9. (debark person4 plane6 city3)
   deleted: (in person4 plane6)
   added: (at person4 city3)
   goals met: 6 of 23
10. (zoom plane5 city4 city1 fl3 fl2 fl1)
   deleted: (at plane5 city4) (fuel-level plane5 fl3)
   added: (at plane5 city1) (fuel-level plane5 fl1)
   goals met: 6 of 23
11. (board person9 plane5 city1)
   deleted: (at person9 city1)
   added: (in person9 plane5)
   goals met: 6 of 23
12. (board person3 plane5 city1)
   deleted: (at person3 city1)
   added: (in person3 plane5)
   goals met: 6 of 23
13. (board person22 plane4 city4)
   deleted: (at person22 city4)
   added: (in person22 plane4)
   goals met: 6 of 23
14. (board person16 plane4 city4)
   deleted: (at person16 city4)
   added: (in person16 plane4)
   goals met: 6 of 23
15. (zoom plane4 city4 city1 fl6 fl5 fl4)
   deleted: (at plane4 city4) (fuel-level plane4 fl6)
   added: (at plane4 city1) (fuel-level plane4 fl4)
   goals met: 6 of 23
16. (debark person16 plane4 city1)
   deleted: (in person16 plane4)
   added: (at person16 city1)
   goals met: 7 of 23
17. (zoom plane4 city1 city3 fl4 fl3 fl2)
   deleted: (at plane4 city1) (fuel-level plane4 fl4)
   added: (at plane4 city3) (fuel-level plane4 fl2)
   goals met: 7 of 23
18. (debark person22 plane4 city3)
   deleted: (in person22 plane4)
   added: (at person22 city3)
   goals met: 8 of 23
19. (board person10 plane3 city2)
   deleted: (at person10 city2)
   added: (in person10 plane3)
   goals met: 8 of 23
20. (fly plane3 city2 city3 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 8 of 23
21. (debark person10 plane3 city3)
   deleted: (in person10 plane3)
   added: (at person10 city3)
   goals met: 9 of 23
22. (board person21 plane2 city3)
   deleted: (at person21 city3)
   added: (in person21 plane2)
   goals met: 9 of 23
23. (zoom plane2 city3 city4 fl5 fl4 fl3)
   deleted: (at plane2 city3) (fuel-level plane2 fl5)
   added: (at plane2 city4) (fuel-level plane2 fl3)
   goals met: 9 of 23
24. (board person17 plane4 city3)
   deleted: (at person17 city3)
   added: (in person17 plane4)
   goals met: 9 of 23
25. (board person15 plane4 city3)
   deleted: (at person15 city3)
   added: (in person15 plane4)
   goals met: 9 of 23
26. (debark person21 plane2 city4)
   deleted: (in person21 plane2)
   added: (at person21 city4)
   goals met: 10 of 23
27. (board person8 plane1 city2)
   deleted: (at person8 city2)
   added: (in person8 plane1)
   goals met: 10 of 23
28. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   goals met: 10 of 23
29. (board person23 plane1 city2)
   deleted: (at person23 city2)
   added: (in person23 plane1)
   goals met: 10 of 23
30. (board person20 plane1 city2)
   deleted: (at person20 city2)
   added: (in person20 plane1)
   goals met: 10 of 23
31. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   goals met: 10 of 23
32. (zoom plane1 city2 city4 fl6 fl5 fl4)
   deleted: (at plane1 city2) (fuel-level plane1 fl6)
   added: (at plane1 city4) (fuel-level plane1 fl4)
   goals met: 10 of 23
33. (debark person8 plane1 city4)
   deleted: (in person8 plane1)
   added: (at person8 city4)
   goals met: 11 of 23
34. (debark person20 plane1 city4)
   deleted: (in person20 plane1)
   added: (at person20 city4)
   goals met: 12 of 23
35. (zoom plane1 city4 city0 fl4 fl3 fl2)
   deleted: (at plane1 city4) (fuel-level plane1 fl4)
   added: (at plane1 city0) (fuel-level plane1 fl2)
   goals met: 12 of 23
36. (debark person23 plane1 city0)
   deleted: (in person23 plane1)
   added: (at person23 city0)
   goals met: 13 of 23
37. (zoom plane4 city3 city1 fl2 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl2)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 13 of 23
38. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 23
39. (debark person15 plane4 city1)
   deleted: (in person15 plane4)
   added: (at person15 city1)
   goals met: 14 of 23
40. (fly plane4 city1 city4 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 14 of 23
41. (debark person17 plane4 city4)
   deleted: (in person17 plane4)
   added: (at person17 city4)
   goals met: 15 of 23
42. (zoom plane1 city0 city1 fl2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl2)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 15 of 23
43. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 23
44. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   goals met: 16 of 23
45. (fly plane1 city1 city3 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 16 of 23
46. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   goals met: 17 of 23
47. (fly plane5 city1 city3 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 17 of 23
48. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 23
49. (debark person9 plane5 city3)
   deleted: (in person9 plane5)
   added: (at person9 city3)
   goals met: 18 of 23
50. (fly plane5 city3 city4 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 18 of 23
51. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 23
52. (debark person3 plane5 city4)
   deleted: (in person3 plane5)
   added: (at person3 city4)
   goals met: 19 of 23
53. (fly plane5 city4 city5 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 20 of 23
54. (board person19 plane5 city5)
   deleted: (at person19 city5)
   added: (in person19 plane5)
   goals met: 20 of 23
55. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 20 of 23
56. (board person11 plane5 city5)
   deleted: (at person11 city5)
   added: (in person11 plane5)
   goals met: 20 of 23
57. (zoom plane2 city4 city2 fl3 fl2 fl1)
   deleted: (at plane2 city4) (fuel-level plane2 fl3)
   added: (at plane2 city2) (fuel-level plane2 fl1)
   goals met: 20 of 23
58. (board person13 plane2 city2)
   deleted: (at person13 city2)
   added: (in person13 plane2)
   goals met: 20 of 23
59. (fly plane2 city2 city1 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 20 of 23
60. (debark person13 plane2 city1)
   deleted: (in person13 plane2)
   added: (at person13 city1)
   goals met: 21 of 23
61. (fly plane5 city5 city2 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 20 of 23
62. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 20 of 23
63. (debark person19 plane5 city2)
   deleted: (in person19 plane5)
   added: (at person19 city2)
   goals met: 21 of 23
64. (fly plane5 city2 city3 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 21 of 23
65. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 21 of 23
66. (debark person11 plane5 city3)
   deleted: (in person11 plane5)
   added: (at person11 city3)
   goals met: 22 of 23
67. (fly plane5 city3 city5 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 23 of 23
